# michael-fighting.github.io
个人博客

## go语言的基础知识

### 1. 基本数据的转换

* Go在不同类型的变量之间赋值时需要显示转换，即golang中数据类型不能自动转换；
* 被转换的是变量存储的数据（值），变量本身的数据类型没有变化；
* 范围小向范围大转换时，按溢出处理，不会报错

### 2. 常见的引用类型与值类型
* 值类型： int, float, bool, string, 数组， 结构体struct
* 引用类型：指针、slice切片, map, 管道chan, interface

### 3. 标识符注意事项
* 下划线"_" 本身是一个特殊的标识符，用于忽略某个返回值；
* int, float系列不是系统保留关键字，可作为标识符，但不推荐；
* 变量名、函数名、常量名首字母大写，则可以被其他的包访问，首字母小写，则只能在本包中使用；
* 系统保留关键字有25个，预定标识符为36个。

### 4. 原码，反码及补码
* 二进制的最高位是符号位，0表示正数，1表示负数；
* 正数的原码，反码，补码都一样；
* 负数的反码 = 它的原码符号位不变，其它位取反；
* 负数的补码 = 它的反码 + 1；
* 0的反码、补码都是0；
* 在计算机运算的时候，都是以补码的方式来计算的。

### 5. 易漏运算符
* 异或运算符^ 对应位不同结果为1，否则为0
* 右移运算符>> 低位溢出，符号位不变，并用符号位补溢出的高位
* 左移运算符<< 符号位不变，低位补0

### 6. break与continue区别
* break用于终止某个语句块的执行，用于终端当前for循环或跳出switch语句
* continue语句用于结束本次循环，继续执行下一循环

### 7. 函数的注意事项
* go语言不支持函数重载（指函数名相同，但形参数目或类型不同）
* 在go中，函数本身也是一种数据类型，可以赋值给一个变量，则该变量就是一个函数类型的变量了。通过该变量可以对函数调用
* 函数既然是一种数据类型，因此在go中，函数可以作为形参，并且被调用

### 8. 关于init的面试题
* 如果main.go和utils.go都含有变量定义，init函数时，执行的流程为
* utils.go： 变量定义 - init函数 -
* main.go: 变量定义 - init函数 - main函数 
